In [1]:
import pandas as pd
import csv
import os

prices = pd.read_csv("Gold_Prices.csv")
prices.head()

,Date,US dollar,Euro,Japanese yen,Pound sterling,Canadian dollar,Swiss franc,Indian rupee,Saudi riyal,UAE dirham,Thai baht,Korean won,South African rand,Australian dollar
0,1/2/79,226.8,137.3,43164.9,111.5,263.7,359.6,1792.9,735.6,851.3,4454.6,107470.0,194.6,193.6
1,1/3/79,218.6,134.0,43717.9,108.0,264.4,365.9,1802.2,739.4,855.7,4477.7,108027.4,192.2,193.0
2,1/4/79,223.2,136.8,43674.9,110.7,264.1,366.4,1811.7,743.4,860.3,4501.5,108602.5,193.0,194.6
3,1/5/79,225.5,138.4,44582.5,111.6,268.4,373.7,1843.6,756.4,875.4,4580.6,110510.4,196.4,197.9
4,1/8/79,223.1,136.4,44436.2,110.2,269.5,372.6,1841.3,750.9,869.7,4574.2,110356.3,197.2,197.9

In [3]:
prices['Date'] = pd.to_datetime(prices['Date'])

In [14]:
monthly_prices = prices.groupby(pd.Grouper(key='Date', freq = 'M')).mean()
monthly_prices.head()

,US dollar,Euro,Japanese yen,Pound sterling,Canadian dollar,Swiss franc,Indian rupee,Saudi riyal,UAE dirham,Thai baht,Korean won,South African rand,Australian dollar
Date,,,,,,,,,,,,,
1979-01-31,227.290909,139.531818,44853.113636,113.327273,269.545455,378.772727,1852.859091,754.086364,869.400000,4582.186364,111186.568182,197.018182,198.600000
1979-02-28,245.690000,151.310000,49213.155000,122.555000,293.185000,410.595000,2010.370000,822.305000,939.105000,4949.500000,118284.045000,209.860000,216.650000
1979-03-31,242.063636,149.304545,49989.427273,118.795455,284.222727,407.263636,1974.931818,810.145455,926.236364,4884.522727,116507.063636,204.359091,215.945455
1979-04-30,238.685714,148.504762,51574.223810,115.138095,273.609524,409.828571,1956.809524,817.961905,918.000000,4832.857143,115259.909524,202.347619,215.414286
1979-05-31,257.800000,161.121739,56482.600000,125.230435,297.839130,445.634783,2119.934783,871.334783,983.695652,5210.843478,124753.821739,217.695652,233.165217

In [6]:
quarterly_prices = prices.groupby(pd.Grouper(key='Date', freq = 'Q')).mean()
quarterly_prices.head()

,US dollar,Euro,Japanese yen,Pound sterling,Canadian dollar,Swiss franc,Indian rupee,Saudi riyal,UAE dirham,Thai baht,Korean won,South African rand,Australian dollar
Date,,,,,,,,,,,,,
1979-03-31,238.118750,146.571875,47981.234375,118.090625,281.978125,398.510938,1944.043750,794.675000,910.720312,4800.900000,115233.450000,203.554687,210.203125
1979-06-30,258.501538,160.895385,56378.684615,124.201538,299.564615,443.389231,2108.896923,876.696923,988.664615,5211.943077,124209.755385,218.515385,233.232308
1979-09-30,315.703077,190.206154,69089.276923,141.581538,367.958462,517.072308,2517.778462,1060.887692,1195.429231,6420.269231,153096.298462,264.081538,279.850769
1979-12-31,413.916667,246.643939,98773.866667,191.545455,486.727273,672.972727,3369.612121,1393.972727,1570.353030,8403.963636,200378.080303,342.956061,375.313636
1980-03-31,630.252308,376.127692,153243.935385,279.272308,733.340000,1044.875385,5043.516923,2112.749231,2369.169231,12809.687692,343791.578462,513.890769,571.766154

In [10]:
quarterly_prices['Quarter'] = quarterly_prices.index
quarterly_prices['Quarter'] = quarterly_prices['Quarter'].dt.quarter
quarterly_prices.head()

,US dollar,Euro,Japanese yen,Pound sterling,Canadian dollar,Swiss franc,Indian rupee,Saudi riyal,UAE dirham,Thai baht,Korean won,South African rand,Australian dollar,Quarter
Date,,,,,,,,,,,,,,
1979-03-31,238.118750,146.571875,47981.234375,118.090625,281.978125,398.510938,1944.043750,794.675000,910.720312,4800.900000,115233.450000,203.554687,210.203125,1
1979-06-30,258.501538,160.895385,56378.684615,124.201538,299.564615,443.389231,2108.896923,876.696923,988.664615,5211.943077,124209.755385,218.515385,233.232308,2
1979-09-30,315.703077,190.206154,69089.276923,141.581538,367.958462,517.072308,2517.778462,1060.887692,1195.429231,6420.269231,153096.298462,264.081538,279.850769,3
1979-12-31,413.916667,246.643939,98773.866667,191.545455,486.727273,672.972727,3369.612121,1393.972727,1570.353030,8403.963636,200378.080303,342.956061,375.313636,4
1980-03-31,630.252308,376.127692,153243.935385,279.272308,733.340000,1044.875385,5043.516923,2112.749231,2369.169231,12809.687692,343791.578462,513.890769,571.766154,1

In [11]:
quarterly_prices['Year'] = quarterly_prices.index
quarterly_prices['Year'] = quarterly_prices['Year'].dt.year
quarterly_prices.head()

,US dollar,Euro,Japanese yen,Pound sterling,Canadian dollar,Swiss franc,Indian rupee,Saudi riyal,UAE dirham,Thai baht,Korean won,South African rand,Australian dollar,Quarter,Year
Date,,,,,,,,,,,,,,,
1979-03-31,238.118750,146.571875,47981.234375,118.090625,281.978125,398.510938,1944.043750,794.675000,910.720312,4800.900000,115233.450000,203.554687,210.203125,1,1979
1979-06-30,258.501538,160.895385,56378.684615,124.201538,299.564615,443.389231,2108.896923,876.696923,988.664615,5211.943077,124209.755385,218.515385,233.232308,2,1979
1979-09-30,315.703077,190.206154,69089.276923,141.581538,367.958462,517.072308,2517.778462,1060.887692,1195.429231,6420.269231,153096.298462,264.081538,279.850769,3,1979
1979-12-31,413.916667,246.643939,98773.866667,191.545455,486.727273,672.972727,3369.612121,1393.972727,1570.353030,8403.963636,200378.080303,342.956061,375.313636,4,1979
1980-03-31,630.252308,376.127692,153243.935385,279.272308,733.340000,1044.875385,5043.516923,2112.749231,2369.169231,12809.687692,343791.578462,513.890769,571.766154,1,1980

In [12]:
quarterly_prices.to_csv('Quarterly_GoldPrices.csv')

In [15]:
monthly_prices.to_csv('Monthly_GoldPrices.csv')